Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFE124.PIC
      <edc:SFRDef edc:_addr="0x1F84B0E0" edc:_begin="0x88" edc:_end="0x8c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="23" edc:access="---nnnnn-nnnnnnn------nnnnnnnnnn" edc:cname="ADC3TIME" edc:desc="" edc:impl="0x1f7f03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000-0000000------0000000000" edc:name="ADC3TIME" edc:nzwidth="32" edc:por="---00000-0000000------0000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0E4" edc:_begin="0x88" edc:_end="0x8c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="24" edc:access="---nnnnn-nnnnnnn------nnnnnnnnnn" edc:cname="ADC4TIME" edc:desc="" edc:impl="0x1f7f03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000-0000000------0000000000" edc:name="ADC4TIME" edc:nzwidth="32" edc:por="---00000-0000000------0000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F84B0E8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x1F84B0F0" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="25" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCEIEN1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCEIQEN1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIEN0" edc:mask="0x1" edc:name="EIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN1" edc:mask="0x1" edc:name="EIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN2" edc:mask="0x1" edc:name="EIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN3" edc:mask="0x1" edc:name="EIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN4" edc:mask="0x1" edc:name="EIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN5" edc:mask="0x1" edc:name="EIEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN6" edc:mask="0x1" edc:name="EIEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN7" edc:mask="0x1" edc:name="EIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN8" edc:mask="0x1" edc:name="EIEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN9" edc:mask="0x1" edc:name="EIEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN10" edc:mask="0x1" edc:name="EIEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN11" edc:mask="0x1" edc:name="EIEN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN12" edc:mask="0x1" edc:name="EIEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN13" edc:mask="0x1" edc:name="EIEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN14" edc:mask="0x1" edc:name="EIEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN15" edc:mask="0x1" edc:name="EIEN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN16" edc:mask="0x1" edc:name="EIEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN17" edc:mask="0x1" edc:name="EIEN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN18" edc:mask="0x1" edc:name="EIEN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN19" edc:mask="0x1" edc:name="EIEN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN20" edc:mask="0x1" edc:name="EIEN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN21" edc:mask="0x1" edc:name="EIEN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN22" edc:mask="0x1" edc:name="EIEN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN23" edc:mask="0x1" edc:name="EIEN23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN24" edc:mask="0x1" edc:name="EIEN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN25" edc:mask="0x1" edc:name="EIEN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN26" edc:mask="0x1" edc:name="EIEN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN27" edc:mask="0x1" edc:name="EIEN27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN28" edc:mask="0x1" edc:name="EIEN28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN29" edc:mask="0x1" edc:name="EIEN29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN30" edc:mask="0x1" edc:name="EIEN30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN31" edc:mask="0x1" edc:name="EIEN31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0F4" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="25" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="ADCEIEN2" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0000000000000" edc:name="ADCEIQEN2" edc:nzwidth="32" edc:por="-------------------0000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIEN32" edc:mask="0x1" edc:name="EIEN32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN33" edc:mask="0x1" edc:name="EIEN33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN34" edc:mask="0x1" edc:name="EIEN34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN35" edc:mask="0x1" edc:name="EIEN35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN36" edc:mask="0x1" edc:name="EIEN36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN37" edc:mask="0x1" edc:name="EIEN37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN38" edc:mask="0x1" edc:name="EIEN38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN39" edc:mask="0x1" edc:name="EIEN39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN40" edc:mask="0x1" edc:name="EIEN40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN41" edc:mask="0x1" edc:name="EIEN41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN42" edc:mask="0x1" edc:name="EIEN42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN43" edc:mask="0x1" edc:name="EIEN43" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN44" edc:mask="0x1" edc:name="EIEN44" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0F8" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="25" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADCEISTAT1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCEISTAT1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIRDY0" edc:mask="0x1" edc:name="EIRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY1" edc:mask="0x1" edc:name="EIRDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY2" edc:mask="0x1" edc:name="EIRDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY3" edc:mask="0x1" edc:name="EIRDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY4" edc:mask="0x1" edc:name="EIRDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY5" edc:mask="0x1" edc:name="EIRDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY6" edc:mask="0x1" edc:name="EIRDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY7" edc:mask="0x1" edc:name="EIRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY8" edc:mask="0x1" edc:name="EIRDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY9" edc:mask="0x1" edc:name="EIRDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY10" edc:mask="0x1" edc:name="EIRDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY11" edc:mask="0x1" edc:name="EIRDY11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY12" edc:mask="0x1" edc:name="EIRDY12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY13" edc:mask="0x1" edc:name="EIRDY13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY14" edc:mask="0x1" edc:name="EIRDY14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY15" edc:mask="0x1" edc:name="EIRDY15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY16" edc:mask="0x1" edc:name="EIRDY16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY17" edc:mask="0x1" edc:name="EIRDY17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY18" edc:mask="0x1" edc:name="EIRDY18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY19" edc:mask="0x1" edc:name="EIRDY19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY20" edc:mask="0x1" edc:name="EIRDY20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY21" edc:mask="0x1" edc:name="EIRDY21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY22" edc:mask="0x1" edc:name="EIRDY22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY23" edc:mask="0x1" edc:name="EIRDY23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY24" edc:mask="0x1" edc:name="EIRDY24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY25" edc:mask="0x1" edc:name="EIRDY25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY26" edc:mask="0x1" edc:name="EIRDY26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY27" edc:mask="0x1" edc:name="EIRDY27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY28" edc:mask="0x1" edc:name="EIRDY28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY29" edc:mask="0x1" edc:name="EIRDY29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY30" edc:mask="0x1" edc:name="EIRDY30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY31" edc:mask="0x1" edc:name="EIRDY31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0FC" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="25" edc:access="-------------------rrrrrrrrrrrrr" edc:cname="ADCEISTAT2" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0000000000000" edc:name="ADCEISTAT2" edc:nzwidth="32" edc:por="-------------------0000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIRDY32" edc:mask="0x1" edc:name="EIRDY32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY33" edc:mask="0x1" edc:name="EIRDY33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY34" edc:mask="0x1" edc:name="EIRDY34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY35" edc:mask="0x1" edc:name="EIRDY35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY36" edc:mask="0x1" edc:name="EIRDY36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY37" edc:mask="0x1" edc:name="EIRDY37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY38" edc:mask="0x1" edc:name="EIRDY38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY39" edc:mask="0x1" edc:name="EIRDY39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY40" edc:mask="0x1" edc:name="EIRDY40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY41" edc:mask="0x1" edc:name="EIRDY41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY42" edc:mask="0x1" edc:name="EIRDY42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY43" edc:mask="0x1" edc:name="EIRDY43" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY44" edc:mask="0x1" edc:name="EIRDY44" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
